In [55]:
# Import required libraries

import numpy as np
import pandas as pd

In [56]:
# Load datasets

price_df = pd.read_csv('airbnb_price.csv')
room_type_df = pd.read_excel('airbnb_room_type.xlsx')
review_df = pd.read_csv('airbnb_last_review.tsv', sep='\t')

In [57]:
# Explore datasets

In [58]:
price_df.head()

   listing_id        price                nbhood_full
0        2595  225 dollars         Manhattan, Midtown
1        3831   89 dollars     Brooklyn, Clinton Hill
2        5099  200 dollars     Manhattan, Murray Hill
3        5178   79 dollars  Manhattan, Hell's Kitchen
4        5238  150 dollars       Manhattan, Chinatown

In [59]:
price_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25209 entries, 0 to 25208
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   listing_id   25209 non-null  int64
 1   price        25209 non-null  object
 2   nbhood_full  25209 non-null  object
dtypes: int64(1), object(2)
memory usage: 591.0+ KB

In [60]:
room_type_df.head()

   listing_id                                description        room_type
0        2595                      Skylit Midtown Castle  Entire home/apt
1        3831            Cozy Entire Floor of Brownstone  Entire home/apt
2        5099  Large Cozy 1 BR Apartment In Midtown East  Entire home/apt
3        5178            Large Furnished Room Near B'way     private room
4        5238         Cute & Cozy Lower East Side 1 bdrm  Entire home/apt

In [61]:
room_type_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25209 entries, 0 to 25208
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   listing_id   25209 non-null  int64
 1   description  25199 non-null  object
 2   room_type    25209 non-null  object
dtypes: int64(1), object(2)
memory usage: 591.0+ KB

In [62]:
review_df.head()

   listing_id    host_name   last_review
0        2595     Jennifer   May 21 2019
1        3831  LisaRoxanne  July 05 2019
2        5099        Chris  June 22 2019
3        5178     Shunichi  June 24 2019
4        5238          Ben  June 09 2019

In [63]:
review_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25209 entries, 0 to 25208
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   listing_id   25209 non-null  int64
 1   host_name    25201 non-null  object
 2   last_review  25209 non-null  object
dtypes: int64(1), object(2)
memory usage: 591.0+ KB

In [64]:
# Merge datasets on listing_id

merged_df = pd.merge(price_df, room_type_df, on="listing_id").merge(review_df, on="listing_id")
merged_df.head()

,listing_id,price,nbhood_full,description,room_type,host_name,last_review
0,2595,225 dollars,"Manhattan, Midtown",Skylit Midtown Castle,Entire home/apt,Jennifer,May 21 2019
1,3831,89 dollars,"Brooklyn, Clinton Hill",Cozy Entire Floor of Brownstone,Entire home/apt,LisaRoxanne,July 05 2019
2,5099,200 dollars,"Manhattan, Murray Hill",Large Cozy 1 BR Apartment In Midtown East,Entire home/apt,Chris,June 22 2019
3,5178,79 dollars,"Manhattan, Hell's Kitchen",Large Furnished Room Near B'way,private room,Shunichi,June 24 2019
4,5238,150 dollars,"Manhattan, Chinatown",Cute & Cozy Lower East Side 1 bdrm,Entire home/apt,Ben,June 09 2019

In [65]:
# Convert last_review (object) to datetime

merged_df['last_review'] = pd.to_datetime(merged_df['last_review'],format='%B %d %Y')

In [66]:
# Reformat prices and convert to integer

merged_df['price_clean'] = merged_df['price'].str.replace(' dollars', '').astype('int')

In [67]:
# Find the oldest review

oldest_review = merged_df['last_review'].min()
print(f"Oldest review: {oldest_review}")

Oldest review: 2019-01-01 00:00:00

In [68]:
# Find the most recent review

most_recent_review = merged_df['last_review'].max()
print(f"Most recent review: {most_recent_review}")

Most recent review: 2019-07-09 00:00:00

In [69]:
# Find number of private rooms

merged_df['room_type'].value_counts()

Entire home/apt    8458
Private room       7241
entire home/apt    2665
private room       2248
ENTIRE HOME/APT    2143
PRIVATE ROOM       1867
Shared room         380
shared room         110
SHARED ROOM          97
Name: room_type, dtype: int64

In [70]:
# Fix formatting issues by converting all values to lower case

merged_df['room_type'] = merged_df['room_type'].str.lower()
merged_df['room_type'].value_counts()

entire home/apt    13266
private room       11356
shared room          587
Name: room_type, dtype: int64

In [71]:
private_rooms = merged_df['room_type'].value_counts()[1]
print(f"Number of private rooms: {private_rooms}")

Number of private rooms: 11356

In [72]:
# Find the average listing price, rounded to the nearest penny 

average_listing_price = round(merged_df['price_clean'].mean(), 2)
print(f"Average listing price: {average_listing_price}")

Average listing price: 141.78